Revit 2027 API
DefaultDivideSettings.GetSurfaceDistance Method
 Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetSurfaceDistance(
	UVGridlineType gridlines
)
Public Function GetSurfaceDistance (
	gridlines As UVGridlineType
) As Double
public:
double GetSurfaceDistance(
	UVGridlineType gridlines
)
member GetSurfaceDistance :
        gridlines : UVGridlineType -> float
Parameters
gridlines UVGridlineType
 U-gridlines or V-gridlines.
Return Value
Double
 The default distance for the layout.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace